cylinder_re200/constant/turbulenceProperties.nnTBNN
FoamFile { version 2.0; format ascii; class dictionary; object turbulenceProperties; }

simulationType RAS;

RAS
{
    RASModel    nnTBNN;
    turbulence  on;
    printCoeffs on;

    nnTBNNCoeffs
    {
        weightsDir  "constant/nn_weights/tbnn_paper";
        nutMax      1.0;
    }
}
