cylinder_re200/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "5000";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
68056
(
0.011680008
0.0092070961
0.0075212709
0.0063120326
0.0054096133
0.0047145496
0.0041652448
0.0037217805
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.015;
    }
    outlet
    {
        type            zeroGradient;
    }
    top
    {
        type            slip;
    }
    bottom
    {
        type            slip;
    }
    frontAndBack
    {
        type            empty;
    }
    cylinder
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar> 
912
(
0.0001340749
3.9825189e-05
0.00041985907
3.1717004e-06
0.00030271059
6.9539247e-05
1.5789862e-05
1.4430053e-05
...
)
;
    }
}


// ************************************************************************* //
